Revit 2027 API
Leader Class
 A leader object that can be attached to annotation elements such as text notes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.Leader
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class Leader : APIObject
Public Class Leader
	Inherits APIObject
public ref class Leader : public APIObject
type Leader =
    class
        inherit APIObject
    end
The Leader type exposes the following members.
Properties
Name | Description
Anchor |  Anchor point of the Leader
Elbow |  Elbow point of the Leader.
End |  End point of the Leader.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LeaderShape |  Geometric style of the leader
Top
Methods
Name | Description
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 For information on how to attach or get leaders to/from a text annotation refer to corresponding methods of TextNote class.
See Also
Reference
Autodesk.Revit.DB Namespace